# Some Python handson excercises
## Working with Missing Values

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [29]:
# Create a Pandas Dataframe
df = pd.DataFrame({'A': [1,2,3,4],
                   'B': [4,np.nan,np.nan,6],
                   'C': [np.nan,np.nan,8,9]})
df['states'] = 'AA BB CC DD'.split()
df.set_index('states',inplace=True)
print(df)

        A    B    C
states
AA      1  4.0  NaN
BB      2  NaN  NaN
CC      3  NaN  8.0
DD      4  6.0  9.0

In [30]:
print('\n Dropping a row with nan value\n','-'*30, sep='')
print(df.dropna(axis=0))

 Dropping a row with nan value
------------------------------
        A    B    C
states
DD      4  6.0  9.0

In [31]:
print('\n Dropping a column with nan value\n','-'*30,sep='')
print(df.dropna(axis=1))

 Dropping a column with nan value
------------------------------
        A
states
AA      1
BB      2
CC      3
DD      4

In [35]:
print('\n Dropping a column with max 2 nan values\n','-'*30,sep='')
print(df.dropna(axis=0, thresh=2))

 Dropping a column with max 2 nan values
------------------------------
        A    B    C
states
AA      1  4.0  NaN
CC      3  NaN  8.0
DD      4  6.0  9.0

In [33]:
print('\n Fill missing values\n','-'*30,sep='')
print(df.fillna('Fill Value'))

 Fill missing values
------------------------------
        A           B           C
states
AA      1           4  Fill Value
BB      2  Fill Value  Fill Value
CC      3  Fill Value           8
DD      4           6           9

In [37]:
print('\n Fill with mean values\n','-'*30,sep='')
print(df.fillna(value=df['B'].mean()))

 Fill with mean values
------------------------------
        A    B    C
states
AA      1  4.0  5.0
BB      2  5.0  5.0
CC      3  5.0  8.0
DD      4  6.0  9.0

## Merge , Groupby, Summarise data

In [38]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [40]:
byComp = df.groupby('Company')
print("\nGrouping by 'Company' column and listing mean sales\n",'-'*55, sep='')
print(byComp.mean())

Grouping by 'Company' column and listing mean sales
-------------------------------------------------------
         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [41]:
print(byComp.sum())

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [55]:
print("\nAll in one line of command (Stats for 'GOOG')\n",'-'*65, sep='')
print(pd.DataFrame(df.groupby('Company').describe().loc['GOOG']).transpose())

All in one line of command (Stats for 'GOOG')
-----------------------------------------------------------------
     Sales
     count   mean        std    min    25%    50%    75%    max
GOOG   2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

In [57]:
print("\nAll in one line of command (Stats for 'GOOG')\n",'-'*65, sep='')
print(pd.DataFrame(df.groupby('Company').describe().loc[['GOOG','FB']]))

All in one line of command (Stats for 'GOOG')
-----------------------------------------------------------------
        Sales
        count   mean        std    min     25%    50%     75%    max
Company
GOOG      2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
FB        2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [59]:
# Merging two data frames
# Creating data frames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [60]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [61]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])

In [63]:
df_cat1 = pd.concat([df1,df2,df3],axis=0)
print('\nConcatenation based on rows\n','-'*30,sep='')
print(df_cat1)

Concatenation based on rows
------------------------------
      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [64]:
df_cat2 = pd.concat([df1,df2,df3],axis=1)
print('\nConcatenation based on columns\n','-'*30,sep='')
print(df_cat2)

Concatenation based on columns
------------------------------
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [66]:
df_cat2.fillna(value=0,inplace=True)
print(df_cat2)

     A   B   C   D   A   B   C   D    A    B    C    D
0   A0  B0  C0  D0   0   0   0   0    0    0    0    0
1   A1  B1  C1  D1   0   0   0   0    0    0    0    0
2   A2  B2  C2  D2   0   0   0   0    0    0    0    0
3   A3  B3  C3  D3   0   0   0   0    0    0    0    0
4    0   0   0   0  A4  B4  C4  D4    0    0    0    0
5    0   0   0   0  A5  B5  C5  D5    0    0    0    0
6    0   0   0   0  A6  B6  C6  D6    0    0    0    0
7    0   0   0   0  A7  B7  C7  D7    0    0    0    0
8    0   0   0   0   0   0   0   0   A8   B8   C8   D8
9    0   0   0   0   0   0   0   0   A9   B9   C9   D9
10   0   0   0   0   0   0   0   0  A10  B10  C10  D10
11   0   0   0   0   0   0   0   0  A11  B11  C11  D11

## Merge data by a common key

In [67]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [70]:
left.keys()

Index(['A', 'B', 'key'], dtype='object')

In [72]:
left.items

<bound method DataFrame.iteritems of     A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3>

In [74]:
left.values

array([['A0', 'B0', 'K0'],
       ['A1', 'B1', 'K1'],
       ['A2', 'B2', 'K2'],
       ['A3', 'B3', 'K3']], dtype=object)

In [76]:
merge1 = pd.merge(left, right, how='inner',on='key')
print(merge1)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [78]:
merge2 = pd.merge(left,right,how='outer',on='key')
print(merge2)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [79]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [80]:
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [83]:
pd.merge(left,right,how='left',on=['key1','key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [84]:
pd.merge(left,right,how='right',on=['key1','key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

## join operators

In [85]:

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [86]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [87]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Use Aply Functions

In [88]:
# Define a function
def testfunc(x):
    if (x> 500):
        return (10*np.log10(x))
    else:
        return (x/10)

In [89]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   'col2':[444,555,666,444,333,222,666,777,666,555],
                   'col3':'aaa bb c dd eeee fff gg h iii j'.split()})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j

In [92]:
df['FunctionApplied'] = df['col1'].apply(testfunc)
print(df)

   col1  col2  col3  FunctionApplied
0     1   444   aaa              0.1
1     2   555    bb              0.2
2     3   666     c              0.3
3     4   444    dd              0.4
4     5   333  eeee              0.5
5     6   222   fff              0.6
6     7   666    gg              0.7
7     8   777     h              0.8
8     9   666   iii              0.9
9    10   555     j              1.0

In [93]:
df['col3Length'] = df['col3'].apply(len)
print(df)

   col1  col2  col3  FunctionApplied  col3Length
0     1   444   aaa              0.1           3
1     2   555    bb              0.2           2
2     3   666     c              0.3           1
3     4   444    dd              0.4           2
4     5   333  eeee              0.5           4
5     6   222   fff              0.6           3
6     7   666    gg              0.7           2
7     8   777     h              0.8           1
8     9   666   iii              0.9           3
9    10   555     j              1.0           1

In [94]:
print(df['FunctionApplied'].sum())

5.5

In [95]:
print(df['FunctionApplied'].mean())

0.55

In [96]:
print(df['FunctionApplied'].std())

0.30276503540974914

In [99]:
print(df['FunctionApplied'].apply([lambda x: x**2]))

   <lambda>
0      0.01
1      0.04
2      0.09
3      0.16
4      0.25
5      0.36
6      0.49
7      0.64
8      0.81
9      1.00

In [100]:
print(df.sort_values('col3Length'))

   col1  col2  col3  FunctionApplied  col3Length
2     3   666     c              0.3           1
7     8   777     h              0.8           1
9    10   555     j              1.0           1
1     2   555    bb              0.2           2
3     4   444    dd              0.4           2
6     7   666    gg              0.7           2
0     1   444   aaa              0.1           3
5     6   222   fff              0.6           3
8     9   666   iii              0.9           3
4     5   333  eeee              0.5           4

In [101]:
print(df.sort_values('col3Length',ascending=False))

   col1  col2  col3  FunctionApplied  col3Length
4     5   333  eeee              0.5           4
0     1   444   aaa              0.1           3
5     6   222   fff              0.6           3
8     9   666   iii              0.9           3
1     2   555    bb              0.2           2
3     4   444    dd              0.4           2
6     7   666    gg              0.7           2
2     3   666     c              0.3           1
7     8   777     h              0.8           1
9    10   555     j              1.0           1